GETTING STARTED WITH PANDAS

In [2]:
import pandas as pd

In [3]:
# Pandas Fundamentals
# Advance Application for Pandas

INTRO TO DATAFRAMES

In [5]:
scores = {
    "name": ['Ray,', 'Japhy', 'Zosa'],
    "city": ['San Francisco','San Francsico','Denver'],
    "score": [75,92,94]
}

In [6]:
df = pd.DataFrame(scores)
df

    name           city  score
0   Ray,  San Francisco     75
1  Japhy  San Francsico     92
2   Zosa         Denver     94

In [7]:
df['score']

0    75
1    92
2    94
Name: score, dtype: int64

In [8]:
df['name_city'] = df['name'] + '_' + df['city'] # concatenate the name and city

In [9]:
df[df['score']>90] # return all score with greater than 90

    name           city  score            name_city
1  Japhy  San Francsico     92  Japhy_San Francsico
2   Zosa         Denver     94          Zosa_Denver

In [10]:
iris = pd.read_csv('./employee_202401301913.csv')
iris

,id,organization_id,email_address,Unnamed: 3,service_agreement,registration_stage,manager_email,inviter_id,inviter_role,temp_id,...,annual_rate,xero_id,is_sync,is_updated,xero_status,xero_payroll_calendar_id,xero_ordinary_earnings_rate_id,xero_payroll_calendar_type,xero_payroll_calendar_start_date,myob_employee_id
0,540,33,Emmalene@district360.com.au,NaN,NaN,profile-created,NaN,178.0,Admin,NaN,...,0.0,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,541,40,sarazulaikha03@gmail.com,NaN,NaN,profile-created,NaN,38.0,admin,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN
2,542,40,sdonukmw@sharklasers.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN
3,543,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,544,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
iris.shape

(5, 91)

In [12]:
iris.head(3) # read first 3

,id,organization_id,email_address,Unnamed: 3,service_agreement,registration_stage,manager_email,inviter_id,inviter_role,temp_id,...,annual_rate,xero_id,is_sync,is_updated,xero_status,xero_payroll_calendar_id,xero_ordinary_earnings_rate_id,xero_payroll_calendar_type,xero_payroll_calendar_start_date,myob_employee_id
0,540,33,Emmalene@district360.com.au,NaN,NaN,profile-created,NaN,178.0,Admin,NaN,...,0.0,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,541,40,sarazulaikha03@gmail.com,NaN,NaN,profile-created,NaN,38.0,admin,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN
2,542,40,sdonukmw@sharklasers.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
iris.tail(3) # read the last 3

,id,organization_id,email_address,Unnamed: 3,service_agreement,registration_stage,manager_email,inviter_id,inviter_role,temp_id,...,annual_rate,xero_id,is_sync,is_updated,xero_status,xero_payroll_calendar_id,xero_ordinary_earnings_rate_id,xero_payroll_calendar_type,xero_payroll_calendar_start_date,myob_employee_id
2,542,40,sdonukmw@sharklasers.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN
3,543,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,544,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
iris.dtypes # the variable or the head use

id                                    int64
organization_id                       int64
email_address                        object
Unnamed: 3                          float64
service_agreement                   float64
                                     ...
xero_payroll_calendar_id            float64
xero_ordinary_earnings_rate_id      float64
xero_payroll_calendar_type          float64
xero_payroll_calendar_start_date    float64
myob_employee_id                    float64
Length: 91, dtype: object

In [15]:
iris.loc[3:7] # the starting point and the end point numbers

,id,organization_id,email_address,Unnamed: 3,service_agreement,registration_stage,manager_email,inviter_id,inviter_role,temp_id,...,annual_rate,xero_id,is_sync,is_updated,xero_status,xero_payroll_calendar_id,xero_ordinary_earnings_rate_id,xero_payroll_calendar_type,xero_payroll_calendar_start_date,myob_employee_id
3,543,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,544,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
iris.loc[3,'organization_id']

40

In [17]:
iris.iloc[4,0] # location

544

In [18]:
iris.to_csv('./employee_202401301913.csv',index=False)
iris

,id,organization_id,email_address,Unnamed: 3,service_agreement,registration_stage,manager_email,inviter_id,inviter_role,temp_id,...,annual_rate,xero_id,is_sync,is_updated,xero_status,xero_payroll_calendar_id,xero_ordinary_earnings_rate_id,xero_payroll_calendar_type,xero_payroll_calendar_start_date,myob_employee_id
0,540,33,Emmalene@district360.com.au,NaN,NaN,profile-created,NaN,178.0,Admin,NaN,...,0.0,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,541,40,sarazulaikha03@gmail.com,NaN,NaN,profile-created,NaN,38.0,admin,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN
2,542,40,sdonukmw@sharklasers.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,NaN,0,1,NaN,NaN,NaN,NaN,NaN,NaN
3,543,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,544,40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,0,0,NaN,NaN,NaN,NaN,NaN,NaN

PANDAS OPTION

In [20]:
emissions = pd.DataFrame(
    {"country": ['China','United States','India'],
     "year": ['2018','2018','2018'],
     "co2_emissions": [100600000000.0,5410000000.0,26500000000.0]}
)
emissions

         country  year  co2_emissions
0          China  2018   1.006000e+11
1  United States  2018   5.410000e+09
2          India  2018   2.650000e+10

In [21]:
pd.set_option('display.max_rows',2)
emissions

   country  year  co2_emissions
0    China  2018   1.006000e+11
..     ...   ...            ...
2    India  2018   2.650000e+10

[3 rows x 3 columns]

In [22]:
pd.set_option('display.max_columns',2)
emissions

   country  ... co2_emissions
0    China  ...  1.006000e+11
..     ...  ...           ...
2    India  ...  2.650000e+10

[3 rows x 3 columns]

In [23]:
pd.options.display.float_format = '{:,.2f}'.format
emissions

   country  ...      co2_emissions
0    China  ... 100,600,000,000.00
..     ...  ...                ...
2    India  ...  26,500,000,000.00

[3 rows x 3 columns]

DATA TYPES

In [25]:
planets = pd.read_csv('./planets.csv')
planets

               method  ...  year
0     Radial Velocity  ...  2006
...               ...  ...   ...
1034          Transit  ...  2008

[1035 rows x 6 columns]

In [26]:
planets.head(3)

             method  ...  year
0   Radial Velocity  ...  2006
..              ...  ...   ...
2   Radial Velocity  ...  2011

[3 rows x 6 columns]

In [27]:
planets.dtypes

method    object
           ...
year       int64
Length: 6, dtype: object

In [28]:
planets.mean(numeric_only=True)

number       1.79
           ...
year     2,009.07
Length: 5, dtype: float64

In [29]:
planets.median(numeric_only=True)

number       1.00
           ...
year     2,010.00
Length: 5, dtype: float64

In [30]:
planets.mode()

             method  ...     year
0   Radial Velocity  ... 2,011.00
..              ...  ...      ...
3               NaN  ...      NaN

[4 rows x 6 columns]

In [31]:
planets['number'][0]/planets['mass'][0]

0.14084507042253522

In [32]:
planets['number'][0].astype(float) # change data type using astype

1.0

In [33]:
planets['mass'][0].astype(int)

7

In [34]:
planets['year'][0].astype(str)

'2006'

In [35]:
planets['year_dt'] = pd.to_datetime(planets['year'], format='%Y')
planets['year_dt']

0      2006-01-01
          ...
1034   2008-01-01
Name: year_dt, Length: 1035, dtype: datetime64[ns]

WORKING WITH STRINGS

In [37]:
names = pd.Series(['Pomeray, CODY','Wagner; Jarry','smith,Ray'])

In [38]:
names = names.str.replace(';',',')
names

0    Pomeray, CODY
         ...
2        smith,Ray
Length: 3, dtype: object

In [39]:
names.str.len()

0    13
     ..
2     9
Length: 3, dtype: int64

In [40]:
names = names.str.strip()
names.str.len()

0    13
     ..
2     9
Length: 3, dtype: int64

In [41]:
names = names.str.lower()
names

0    pomeray, cody
         ...
2        smith,ray
Length: 3, dtype: object

In [42]:
names = names.str.split(', ')

In [43]:
names

0    [pomeray, cody]
          ...
2        [smith,ray]
Length: 3, dtype: object

In [44]:
names = pd.Series([i[::-1] for i in names])
names

0    [cody, pomeray]
          ...
2        [smith,ray]
Length: 3, dtype: object

In [45]:
names = [' '.join(i) for i in names]
names

['cody pomeray', 'jarry wagner', 'smith,ray']

WORKING WITH DATES

In [47]:
daterange = pd.period_range('1/1/2020', freq='30d',periods=4)

In [48]:
date_df = pd.DataFrame(data=daterange, columns=['sample date'])
date_df

   sample date
0   2020-01-01
..         ...
3   2020-03-31

[4 rows x 1 columns]

In [49]:
date_df['date difference'] = date_df['sample date'].diff(periods=1)
date_df

D:\appdata\anaconda\Lib\site-packages\pandas\core\arrays\datetimelike.py:1306: RuntimeWarning: overflow encountered in scalar multiply
  new_data = np.array([self.freq.base * x for x in new_i8_data])

   sample date date difference
0   2020-01-01             NaT
..         ...             ...
3   2020-03-31     <30 * Days>

[4 rows x 2 columns]

In [50]:
date_df['first of month'] = date_df['sample date'].values.astype('datetime64[M]')
date_df

   sample date  ... first of month
0   2020-01-01  ...     2020-01-01
..         ...  ...            ...
3   2020-03-31  ...     2020-03-01

[4 rows x 3 columns]

In [51]:
date_df.dtypes

sample date         period[30D]
                      ...
first of month    datetime64[s]
Length: 3, dtype: object

In [52]:
date_df['sample date'] = date_df['sample date'].dt.to_timestamp()
date_df.dtypes

sample date       datetime64[ns]
                       ...
first of month     datetime64[s]
Length: 3, dtype: object

In [53]:
date_df['sample date'] - date_df['first of month']

0    0 days
      ...
3   30 days
Length: 4, dtype: timedelta64[ns]

In [54]:
date_df['sample date'] - date_df['date difference']

C:\Users\Marcel James\AppData\Local\Temp\ipykernel_27564\608647980.py:1: PerformanceWarning: Adding/subtracting object-dtype array to DatetimeArray not vectorized.
  date_df['sample date'] - date_df['date difference']

0                    NaT
            ...
3    2020-03-01 00:00:00
Length: 4, dtype: object

In [55]:
date_df['sample date'] - pd.Timedelta('30 d')

0   2019-12-02
       ...
3   2020-03-01
Name: sample date, Length: 4, dtype: datetime64[ns]

In [56]:
date_df['sample date'].dt.day_name() # returning date name

0    Wednesday
       ...
3      Tuesday
Name: sample date, Length: 4, dtype: object

WORKING WITH MISSING DATA

In [58]:
temps = pd.DataFrame({
    "sequence":[1,2,3,4,5],
    "measurement_type": ['actual','actual','actual',None,'estimated'],
    "temperature_f" : [67.24,84.56,91.61,None,49.64]
})
temps

    sequence  ... temperature_f
0          1  ...         67.24
..       ...  ...           ...
4          5  ...         49.64

[5 rows x 3 columns]

In [59]:
temps.isna() # to identify null values in dateframe

    sequence  ...  temperature_f
0      False  ...          False
..       ...  ...            ...
4      False  ...          False

[5 rows x 3 columns]

In [60]:
temps['temperature_f'].cumsum() # cumulative sum

0    67.24
     ...
4   293.05
Name: temperature_f, Length: 5, dtype: float64

In [61]:
temps['temperature_f'].cumsum(skipna=False)

0   67.24
     ...
4     NaN
Name: temperature_f, Length: 5, dtype: float64

In [62]:
# can specify to retain NA dimensions in grouping
temps.groupby(by=['measurement_type'], dropna=False).max()

                  sequence  temperature_f
measurement_type
actual                   3          91.61
...                    ...            ...
NaN                      4            NaN

[3 rows x 2 columns]

In [63]:
# drop rows with the null using axis = 0 (default)
temps.dropna()

    sequence  ... temperature_f
0          1  ...         67.24
..       ...  ...           ...
4          5  ...         49.64

[4 rows x 3 columns]

In [64]:
# drop columns with null using axis=1
temps.dropna(axis=1)

    sequence
0          1
..       ...
4          5

[5 rows x 1 columns]

In [65]:
temps.fillna(0)

    sequence  ... temperature_f
0          1  ...         67.24
..       ...  ...           ...
4          5  ...         49.64

[5 rows x 3 columns]

In [66]:
temps.ffill()

    sequence  ... temperature_f
0          1  ...         67.24
..       ...  ...           ...
4          5  ...         49.64

[5 rows x 3 columns]

In [67]:
temps.infer_objects()

    sequence  ... temperature_f
0          1  ...         67.24
..       ...  ...           ...
4          5  ...         49.64

[5 rows x 3 columns]

APPLY, MAP and APPLYMAP

In [69]:
df = pd.DataFrame({
    "Region": ['North','West','East','South','North','West','East','South'],
    "Team": ['One','One','One','One','Two','Two','Two','Two'],
    "Squad": ['A','B','C','D','E','F','G','H'],
    "Revenue": [7500,5500,2750,6400,2300,3750,1900,575],
    "Cost": [5200,5100,4400,5300,1250,1300,2100,50]
})
df

   Region  ...  Cost
0   North  ...  5200
..    ...  ...   ...
7   South  ...    50

[8 rows x 5 columns]

In [70]:
# use apply() to alter values along an axis in your dataframe or in a series by applying a function
df['Profit'] = df.apply(lambda x: 'Profit' if x['Revenue']>x['Cost'] else 'Loss', axis=1)
df

   Region  ...  Profit
0   North  ...  Profit
..    ...  ...     ...
7   South  ...  Profit

[8 rows x 6 columns]

In [71]:
# use map to substitue each values in a series, using either a function, dictionary, or series
team_map = {"One":"Red","Two":"Blue"}

In [72]:
df['Team Color'] = df['Team'].map(team_map)
df

   Region  ... Team Color
0   North  ...        Red
..    ...  ...        ...
7   South  ...       Blue

[8 rows x 7 columns]

In [73]:
df.map(lambda x: len(str(x)))

    Region  ...  Team Color
0        5  ...           3
..     ...  ...         ...
7        5  ...           4

[8 rows x 7 columns]

In [74]:
new_col = []
for i in range(0,len(df)):
    rev = df['Revenue'][i]/df[df['Region']==df.loc[i,'Region']]['Revenue'].sum()
    new_col.append(rev)

In [150]:
df['Revenue Share of region'] = new_col
df.sort_values(by='Region')

   Region  ... Revenue Share of region
2    East  ...                    0.59
..    ...  ...                     ...
5    West  ...                    0.41

[8 rows x 8 columns]